{
  "storyboards": [
    {
      "id": 1757138343056,
      "imageUrl": "http://localhost:8000/static/images/storyboard_1757138342_1.png",
      "description": "AI 생성: Here's an analysis of the sketch and a scene description for your storyboard:\n\n**Analysis of the Ske...",
      "endFrameUrl": null
    },
    {
      "id": 1757144818744,
      "imageUrl": "http://localhost:8000/static/images/story_1757144818_1.png",
      "description": "스토리 생성: [kk] she is drinking coffee in a shop...",
      "endFrameUrl": null
    },
    {
      "id": 1757145181628,
      "imageUrl": "http://localhost:8000/static/images/story_1757145181_1.png",
      "description": "스토리 생성:   [kk] girl is eating food in a restaurant...",
      "endFrameUrl": null
    },
    {
      "id": 1757145401170,
      "imageUrl": "http://localhost:8000/static/images/story_1757145401_0.png",
      "description": "스토리 생성: [kk] she is eating food behind the Korean old style house...",
      "endFrameUrl": null
    },
    {
      "id": 1757145924283,
      "imageUrl": "http://localhost:8000/static/images/story_1757145924_1.png",
      "description": "스토리 생성: [탄지로] is eating food in restaurant...",
      "endFrameUrl": null
    },
    {
      "id": 1757164933350,
      "imageUrl": "http://localhost:8000/static/images/storyboard_1757164933_0.png",
      "description": "AI 생성: Okay, let's break down the image and create a scene description based on your request.\n\n**Analysis of the Sketch and Character Placement:**\n\n*   **The Sketch:** The sketch shows a stick figure character in a kicking pose. The right leg is planted firmly on the ground, while the left leg is extended outwards in a kicking motion. Both arms are also extended, likely for balance.\n*   **Tanjiro's Position:** At 80.4% from the left and 28.8% from the top, Tanjiro will be placed towards the right side of the image, roughly in the upper-middle part. He'll be the dominant element in the frame.\n\n**Storyboard Image Scene Description**\n\n**Scene:** A chaotic classroom\n\n**Setting:** A cluttered, slightly rundown classroom. Desks are askew, some upturned. Books and papers are scattered on the floor. A chalkboard is visible in the background, covered in half-erased equations and doodles. Sunlight streams in through a window, illuminating dust motes dancing in the air.\n\n**Character:**\n\n*   **Tanjiro (Main):** Tanjiro is positioned at 80.4% from the left and 28.8% from the top. He is in the middle of a wild kick. His right leg is planted firmly on the floor, providing stability. His left leg is extended high, aiming towards something off-screen (potentially another student or object). His expression should be one of intense focus and action. His arms are outstretched for balance. He's dressed in his Demon Slayer uniform.\n*   **Students (Background):** Several other students are scattered around the room, their expressions ranging from shock and alarm to amusement and indifference. Some might be cowering under desks, others pointing and laughing. Their clothing should be typical Japanese school uniforms.\n\n**Action:**\n\nTanjiro is kicking. The action is sudden and unexpected. The overall feel of the scene should be chaotic and energetic.\n\n**Camera Angle:** Slightly low angle to emphasize Tanjiro's height and the dynamic nature of the kick.\n\n**Lighting:** Bright sunlight streaming in, contrasting with the darker areas of the classroom. Use rim lighting on Tanjiro to highlight his action and separate him from the background.\n\n**Overall Mood:** Energetic, chaotic, and slightly humorous.\n\n**Details:**\n\n*   Consider adding a small, shattered object near where Tanjiro's kick is aimed (like a vase or a stack of papers) to further sell the impact.\n*   Dust and debris kicked up by the action would enhance the sense of movement.\n\nI hope this helps you generate your storyboard image!\n",
      "endFrameUrl": null
    }
  ]
}